app/Controllers/Dashboard.php

    public function index()
    {
        // Cek apakah session 'nama' dan 'email' sudah ada
        if (!$this->session->has('nama') || !$this->session->has('email')) {
            // Jika tidak ada, mungkin arahkan ke halaman login atau lakukan tindakan lain
            return redirect()->to(base_url('login'));
        }
        $booking = $this->booking
            ->join('user', 'user.id = booking.user_id')
            ->join('massage_list', 'massage_list.id = booking.massage_id')
            ->select('booking.*, user.nama, user.jenis_kelamin, massage_list.jenis_massage, massage_list.harga')
            ->findAll();

        $terapis = $this->terapis->findAll();
        $user = $this->user->where('role_id', 2)->findAll();
---
SELECT `booking`.*, `user`.`nama`, `user`.`jenis_kelamin`, `massage_list`.`jenis_massage`, `massage_list`.`harga`
FROM `booking`
JOIN `user` ON `user`.`id` = `booking`.`user_id`
JOIN `massage_list` ON `massage_list`.`id` = `booking`.`massage_id`
SELECT *
FROM `terapis`
SELECT *
FROM `user`
WHERE `role_id` = 2