app/Controllers/ForgotPassword.php

    public function create()
    {
        $email = $this->request->getVar('email');
        // Ambil data pengguna dari database berdasarkan email
        $user = $this->user->getUserByEmail($email);

        if (!$user) {
            $this->session->setFlashdata('sweet_alert', json_encode(['error' => true, 'message'=> 'User Tidak Ada..!']));
            return redirect()->to(base_url('ForgotPassword'));
        }

        $token = bin2hex(random_bytes(32));
        $this->user->update($user['id'], ['token' => $token]);
---
UPDATE `user` SET `token` = 'de3da1e72ee7f921e8674a676dc1320ee9ca8c92bb9f8a5db0d69cebaad0cd9c', `updated_at` = '2024-02-18 10:42:57'
WHERE `user`.`id` IN ('2')