app/Controllers/Login.php

	public function create()
	{
		$validation = \Config\Services::validation();

		// Jalankan validasi
		if (!$this->validate('login')) {
			$this->session->setFlashdata('sweet_alert', json_encode(['error' => true, 'message' => 'Gagal Login']));
			return redirect()->to(base_url('login'))->withInput()->with('validation', $validation);
		}
		/* Jika valid */
		$email = $this->request->getVar('email');
		$password = $this->request->getVar('password');

		// Ambil data pengguna dari database berdasarkan email
		$user = $this->user->where('email', $email)->first();
---
SELECT *
FROM `user`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1