app/Controllers/Transaksi.php

    public function index()
    {
        // Cek apakah session 'nama' dan 'email' sudah ada
        if (!$this->session->has('nama') || !$this->session->has('email')) {
            // Jika tidak ada, mungkin arahkan ke halaman login atau lakukan tindakan lain
            return redirect()->to(base_url('login'));
        }

        $data['nama']  = $this->session->get('nama');
        $data['email'] = $this->session->get('email');

        $booking = $this->booking
            ->join('user', 'user.id = booking.user_id')
            ->join('massage_list', 'massage_list.id = booking.massage_id')
            ->select('booking.*, user.nama, user.jenis_kelamin, massage_list.jenis_massage, massage_list.harga')
            ->join('transaksi', 'transaksi.booking_id = booking.id', 'left') // Gunakan 'left' untuk LEFT JOIN
            ->where('transaksi.booking_id IS NULL', null, false) // Eksklusikan catatan di mana booking_id sudah ada di transaksi
            ->findAll();

        // Kirimkan data ke view
        $data['booking'] = $booking;

        $transaksi = $this->transaksi
            ->join('booking', 'booking.id = transaksi.booking_id')
            ->join('user', 'user.id = booking.user_id')
            ->join('massage_list', 'massage_list.id = booking.massage_id')
            ->join('terapis', 'terapis.id = transaksi.terapis_id')
            ->select('transaksi.*, booking.nomor_booking, booking.tanggal_booking, user.nama, user.jenis_kelamin, massage_list.jenis_massage, massage_list.harga, terapis.nama_terapis, terapis.no_hp')
            ->where('status_booking', 'Selesai')
            ->findAll();
        /* Massage list */
        $data['transaksi'] = $transaksi;

        $data['massage_list'] = $this->massage->findAll();
---
SELECT `booking`.*, `user`.`nama`, `user`.`jenis_kelamin`, `massage_list`.`jenis_massage`, `massage_list`.`harga`
FROM `booking`
JOIN `user` ON `user`.`id` = `booking`.`user_id`
JOIN `massage_list` ON `massage_list`.`id` = `booking`.`massage_id`
LEFT JOIN `transaksi` ON `transaksi`.`booking_id` = `booking`.`id`
WHERE transaksi.booking_id IS NULL
SELECT `transaksi`.*, `booking`.`nomor_booking`, `booking`.`tanggal_booking`, `user`.`nama`, `user`.`jenis_kelamin`, `massage_list`.`jenis_massage`, `massage_list`.`harga`, `terapis`.`nama_terapis`, `terapis`.`no_hp`
FROM `transaksi`
JOIN `booking` ON `booking`.`id` = `transaksi`.`booking_id`
JOIN `user` ON `user`.`id` = `booking`.`user_id`
JOIN `massage_list` ON `massage_list`.`id` = `booking`.`massage_id`
JOIN `terapis` ON `terapis`.`id` = `transaksi`.`terapis_id`
WHERE `status_booking` = 'Selesai'
SELECT *
FROM `massage_list`