app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `email` = 'berlinbercisk23@gmail.com'
 LIMIT 1
---
	public function getUserByEmail($email)
	{
		return $this->where('email', $email)->first();